#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ElettroAle/shared-infrastructure/runs/run-baMhAtu2pGos9dUE

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster]
azurerm_dns_zone.zone: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com]
module.cluster.azurerm_public_ip.lb-outbound-ip: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/publicIPAddresses/pip-cluster-prod-outbound]
module.cluster.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod]
module.cluster.azurerm_public_ip.lb-public-ip: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/MC_rg-cluster_aks-cluster-prod_westeurope/providers/Microsoft.Network/publicIPAddresses/pip-cluster-prod]
azurerm_dns_a_record.a_record: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com/A/elettroale.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.azurerm_public_ip.lb-public-ip has been deleted
  - resource "azurerm_public_ip" "lb-public-ip" {
        id                      = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/MC_rg-cluster_aks-cluster-prod_westeurope/providers/Microsoft.Network/publicIPAddresses/pip-cluster-prod"
      - ip_address              = "52.166.204.140" -> null
        name                    = "pip-cluster-prod"
        tags                    = {}
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_dns_a_record.a_record will be updated in-place
  ~ resource "azurerm_dns_a_record" "a_record" {
        id                  = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com/A/elettroale.com"
        name                = "elettroale.com"
      ~ records             = [
          - "52.166.204.140",
        ] -> (known after apply)
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.cluster.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "cluster-prod"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westeurope"
      + name                                = "aks-cluster-prod"
      + node_resource_group                 = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-cluster"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + workload_identity_enabled           = false

      + api_server_access_profile {
          + authorized_ip_ranges     = (known after apply)
          + subnet_id                = (known after apply)
          + vnet_integration_enabled = (known after apply)
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = 30
              + managed_outbound_ip_count   = (known after apply)
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ip_address_ids     = [
                  + "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/publicIPAddresses/pip-cluster-prod-outbound",
                ]
              + outbound_ip_prefix_ids      = (known after apply)
              + outbound_ports_allocated    = 0
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }
    }

  # module.cluster.azurerm_public_ip.lb-public-ip will be created
  + resource "azurerm_public_ip" "lb-public-ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "pip-cluster-prod"
      + resource_group_name     = "MC_rg-cluster_aks-cluster-prod_westeurope"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.cluster.azurerm_role_assignment.rbac will be created
  + resource "azurerm_role_assignment" "rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod"
      + skip_service_principal_aad_check = true
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_ip = "52.166.204.140" -> (known after apply)

```

</details>

*Pushed by: @ElettroAle, Action: `pull_request`*